app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."sip_username" = 'blah' LIMIT 1
---
  def suggest
    @user = User.new(params[:user])
    sip_username = @user.email.split("@").first

SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
---
  def show
    @user = User.find(current_user.id)